dev/vllm/benchmarks/phase1-batch16k/20260225-025656/rate-0.75.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f9ef5f4c220>, seed=0, num_prompts=300, dataset_name='sharegpt', no_stream=False, dataset_path='/models/benchmarks/conversations-sharegpt-20260224-205203.json', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/nvidia/Llama-3.1-70B-Instruct-FP8', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=0.75, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/models/benchmarks/phase1-batch16k/20260225-025656', result_filename='rate-0.75.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-ef2645ba-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 0.75
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 300/300 [06:58<00:00,  1.40s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Request rate configured (RPS):           0.75      
Benchmark duration (s):                  418.62    
Total input tokens:                      1741762   
Total generated tokens:                  155829    
Request throughput (req/s):              0.72      
Output token throughput (tok/s):         372.25    
Peak output token throughput (tok/s):    592.00    
Peak concurrent requests:                20.00     
Total token throughput (tok/s):          4533.00   
---------------Time to First Token----------------
Mean TTFT (ms):                          159.32    
Median TTFT (ms):                        88.97     
P50 TTFT (ms):                           88.97     
P95 TTFT (ms):                           481.92    
P99 TTFT (ms):                           646.01    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          27.30     
Median TPOT (ms):                        27.07     
P50 TPOT (ms):                           27.07     
P95 TPOT (ms):                           32.54     
P99 TPOT (ms):                           34.07     
---------------Inter-token Latency----------------
Mean ITL (ms):                           27.33     
Median ITL (ms):                         25.60     
P50 ITL (ms):                            25.60     
P95 ITL (ms):                            34.22     
P99 ITL (ms):                            35.70     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          14329.77  
Median E2EL (ms):                        14423.34  
P50 E2EL (ms):                           14423.34  
P95 E2EL (ms):                           29421.89  
P99 E2EL (ms):                           33133.44  
==================================================